Revit 2027 API
UIApplication.ActiveUIDocument Property
Provides access to an object that represents the currently active project.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual UIDocument ActiveUIDocument { get; }
Public Overridable ReadOnly Property ActiveUIDocument As UIDocument
	Get
public:
virtual property UIDocument^ ActiveUIDocument {
	UIDocument^ get ();
}
abstract ActiveUIDocument : UIDocument with get
override ActiveUIDocument : UIDocument with get
Property Value
UIDocument
Exceptions
Exception | Condition
InvalidOperationException | Thrown when attempting to modify the property.
Remarks
External API commands can access this property in read-only mode only! The ability to modify the property is reserved for future implementations.
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace